# ---> Docker related 
brew "docker"
brew "colima"
brew "lazydocker"

# To make both plugin work add "cliPluginsExtraDirs" to ~/.docker/config.json
brew "docker-compose"
brew "docker-buildx"

brew "age"
brew "openssl@3"
brew "bat"
brew "btop"
brew "glib"
brew "chezmoi"
brew "duf"
brew "fd"
brew "fzf"
brew "go"
brew "gopass"
brew "hyperfine"
brew "iproute2mac"
brew "lazygit"
brew "ncdu"
brew "gdu"
brew "neovim"
brew "ouch"
brew "starship"
brew "tailspin"
brew "tealdeer"
brew "tinymist"
brew "tree"
brew "typst"
brew "zellij"
brew "fastfetch"
brew "just"
brew "python@3.14"
brew "uv"
brew "atuin"

# zsh
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# --------------- cask ---------------

cask "alacritty"
cask "karabiner-elements"
cask "qwerty-fr"
cask "shottr"
cask "signal"
cask "thunderbird"
cask "zed"
